/* Localizable String */
sUIName = "Wireless Network Utility";
sUIVersion = "ユーティリティ バージョン";
sDriverVersion = "ドライバ バージョン: v";
sCopyright = "Copyright 2019.";

// Button
OK ="OK";
CANCEL ="キャンセル";
NO ="いいえ";
YES ="はい";
Join="接続";
Profiles="プロファイル";
Join_Other="ほかに接続";
Show_Nets="ネットワークを表示";
Apply="適用";
Remove="削除";
PIN="PINコード";
PBC="プッシュボタン";
Forget="このネットワーク設定を削除";

//DropDownMenu
State_RfOn="USB Wi-Fi: 入";
State_RfOff="USB Wi-Fi: 切";
State_Scan="USB Wi-Fi: ネットワークを検索しています...";
State_Unplug="無線LAN子機が取り付けられていません";
State_Disable="無線LAN子機を有効にしてください";

Info_IfName="Interface Name:";
Info_MacAddr="Address:";
Info_IpAddr= "IP Address:";
Info_Router= "Router:";
Info_Reachable= "Internet: Reachable";
Info_Unreachable= "Internet: Unreachable";
//Info_Security
Info_BSSID= "BSSID:";
Info_Channel= "Channel:";
Info_CountryCode= "Country Code:";
Info_RSSI= "RSSI:";
Info_Noise= "Noise:";
Info_TxRate= "Tx Rate:";
Info_PhyMode= "PHY Mode:";
Info_McsIndex= "MCS Index:";

Radio_ON ="USB Wi-Fi を入にする";
Radio_OFF ="USB Wi-Fi を切にする";
Uninstall = "Uninstall USB-WiFi";
DebugTool = "Wlan Diagnostics Tool";
Join_Other_Network="ほかのネットワークに接続...";
Create_Adhoc="アドホックネットワークを作成する";
WPS_Fun="WPS";
Open_Utility="Wireless Network Utility を開く";
Open_Preference="優先ネットワークを開く";

//ScanTable View
ScanTable_View_Title="接続する Wi-Fi ネットワークを選択します";
ScanTable_View_SubTitle="リストから接続したい Wi-Fi ネットワークを選択し、必要に応じてパスワードを入力してください。";
Associated="接続中";
SignalStrength="信号強度";
Scanning="検索しています...";

// Setting Field View
Join_BroadcastSecAP1="このネットワーク";
Join_BroadcastSecAP2="は、";
Join_BroadcastSecAP3="パスワードが必要です";
Join_HiddenSecAP1="このANY接続拒否のネットワークは、";
Join_HiddenSecAP2="パスワードが必要です";
Join_HiddenOpenAP="ANY接続拒否のネットワーク名を入力してください";


// Join Other
Create_Infra_Title="接続するネットワークの名前を入力します";
Create_Infra_SubTitle="接続したいネットワーク名を入力し、必要に応じてパスワードを入力してください。";
Create_Adhoc_Title="コンピュータ同士のネットワークを作成します";
Create_Adhoc_SubTitle="作成したいコンピュータ同士のネットワーク名を入力してください。";

//Setting Field
Security_None="なし";
Security_OpenWep="OPEN SYSTEM WEP";
Security_SharedWep="SHARED KEY WEP";
Security_WpaTkip="WPA-PSK TKIP";
Security_WpaAes="WPA-PSK AES";
Security_Wpa2Tkip="WPA2-PSK TKIP";
Security_Wpa2Aes="WPA2-PSK AES";
Security_WpaTkip1X="WPA-EAP TKIP";
Security_WpaAes1X="WPA-EAP AES";
Security_Wpa2Tkip1X="WPA2-EAP TKIP";
Security_Wpa2Aes1X="WPA2-EAP AES";
Security_WEP1X="802.1X WEP";
Security_WpaNoneTkip="WPA-None TKIP";
Security_WpaNoneAes="WPA-None AES";
Security_MixMode="セキュリティ";
Security_Wpa3Sae="WPA3 SAE";
Security_Wpa3SuiteB="WPA3 SuiteB";
Security_Wpa3Owe="WPA3 OWE";

//Profile Security Field
Profile_Wep="WEP";
Profile_Wpa="WPA-PSK";
Profile_Wpa2="WPA2-PSK";
Profile_Wpa1X="WPA-EAP";
Profile_Wpa21X="WPA2-EAP";
Profile_Wpa3="WPA3 Personal";
Profile_Wpa31X="WPA3 Enterprise";
Profile_WpaNone="WPA-None";

NetworkName="ネットワーク名:";
Security="セキュリティ:";
Password="パスワード:";
ShowPassword="パスワードを表示";
ASCII="ASCII 入力";
UserName="ユーザ名:";
EAP="EAPの種類:";
PEAP="自動(PEAP)";
TLS="EAP-TLS";
TTLS="EAP-TTLS";
LEAP="EAP-LEAP";
CA_Cert="CA 証明書:";
Client_Cert="クライアント証明書:";
Private_Key="秘密キー:";
Private_Key_Pwd="秘密キー用パスワード:";

Choose_Private_Key="秘密キーファイルを選択 (PEM/DER/PFX)";
Choose_Client_Cert="クライアント証明書ファイルを選択 (PEM/DER/PFX)";
Choose_CA_Cert="CA証明書ファイルを選択 (PEM/DER/CER)";

Select_KeyChain_Cert_Desc="キーチェーンから証明書を選択";
Select_File_Cert_Desc="証明書ファイルの選択";
Select_KeyChain_Identity_Desc="キーチェーンから証明書を選択";
Select_KeyChain_Key_Desc="キーチェーンから秘密キーを選択";
Select_File_Key_Desc="秘密キーファイルの選択";

Cert_Expire="The certificate file is expired";

Cert_Examine_Title1="ネットワーク";
Cert_Examine_Title2="に認証中";
Cert_Examine_Info1="サーバ";
Cert_Examine_Info2="に認証する前に、このネットワークに適切であることを確認するため、サーバの証明書を検査しなければなりません。\n\n証明書を表示するには、\"証明書を表示\"をクリックします。";


// Profiles
PreferredNet="優先ネットワーク:";
StateTitle="状態";
SSIDTitle="SSID";
SecurityTitle="セキュリティ";

//WPS 
WPS_PIN_Title="PINコード式で接続する場合は、以下のPINコードを無線LAN親機に登録してください";
WPS_PBC_Title="The Push Button Configuration (PBC) is performed";
WPS_Second="sec";
WPS_Progress="WPS 状態:";
WPS_init_Str = "  ステータスを初期化しています  ";
WPS_scan_Str = "  接続先を探しています  ";
WPS_connect_Str = "  無線LAN親機に接続しています  ";
WPS_handshake_Str ="  設定を初期化しています  ";
WPS_exchange_Str ="  セキュリティ設定を交換しています  ";
WPS_done_Str = "  セキュリティ設定を交換しました  ";
WPS_fail_Str = "  接続に失敗しました  ";
WPS_start_Str = "  接続を開始します ";
WPS_finish_Str = "     接続が完了しました";
WPS_auto_connect_Str = "無線LAN親機に自動的に接続します。";
WPS_timeout_Str = "     タイムアウトしました";
WPS_connection_failed_Str = "接続に失敗しました。しばらくしてから、もう一度接続を行ってください。";

Wps_overlap_Str = "セッションがオーバーラップしました";
Wps_more_pbc_Str = "プッシュボタン式で接続設定中の無線LAN親機が複数あります";
Wps_retry_Str = "PINコード式で接続するか、しばらく待ってから接続し直してください";

ERROR0 = "エラー";
ERROR1 = "パスワードを入力してください";
ERROR2 = "WEPのキーインデックスが間違っています";
ERROR3 = "パスワードは8～63文字の半角英数字、または64桁の16進数を入力してください";
ERROR4 = "パスワードは16進数(0～9、a～f、A～F)を入力してください";
ERROR5 = "文字入力の場合は5文字または13文字の半角英数字で入力してください";
ERROR6 = "パスワードの文字数(桁数)が間違っています";
ERROR7 = "16進数入力の場合は、10桁または26桁で入力してください";
ERROR8 = "パスワードと確認用パスワードが一致しません";
ERROR9 = "パスワードが文字入力形式ではありません";
ERROR10 = "パスワードが16進数入力形式ではありません";
ERROR11 = "このチャンネルでは、12、13チャンネルまたはバンド2、バンド3のアドホックネットワークには接続できません";
ERROR12 = "WPA-Noneでは、アドホックネットワークには接続できません";
ERROR13 = "WPA2-PSKでは、アドホックネットワークには接続できません";
ERROR14 = "IEEE802.1X/EAPはサポートされていません";
ERROR15 = "Please allow utility to access keychain.";
ERROR16 = "WPA3 isn't support !!";

WARNING0 = "警告";
WARNING1 = "SSIDを入力してください";
WARNING2 = "プロファイル名を入力してください";
WARNING3 = "SSIDが32文字を超えています";
WARNING4 = "同じプロファイル名が存在します。上書きしますか?";
WARNING5 = "選択したプロファイルを削除してもよろしいですか?";

NOTICE0 = "注意";
NOTICE1 = "APモードエラー";
NOTICE2 = "STAモードエラー";
NOTICE3 = "QoSモードのSet値エラー";
NOTICE4 = "QoSモードのGet値エラー";
NOTICE5 = "QoSモードの不正な値";	
NOTICE6 = "RTSしきい値が不正です。(0 ～ 2432)";
NOTICE7 = "フラグメントしきい値が不正です。(256 ~ 2432)";
NOTICE8 = "本ユーティリティに対応した無線LAN子機を取り付けてください。";
NOTICE9 = "無線LAN子機を取り付けてください。";
NOTICE10 = "パスワードが間違っています。もう一度設定を行ってください。";
NOTICE11 = "Are you sure to do uninstallation?";
NOTICE12 = "System Extension Blocked";
NOTICE13 = "System software from developer 'Realtek Semiconductor Corp' was blocked from loading.";